[{"titles":"Fatal shooting: 2500 Center St NW","bodies":"Preliminary information: On Wednesday, October 29, 2025, at around 8:56 AM, Atlanta police were dispatched to a person shot call at 2500 Center St NW. Upon their arrival, they located a female inside of a vehicle with an apparent gunshot wound to her head. She was transported to the hospital where she was pronounced deceased. Investigators with the Homicide Unit will be responding to the scene to determine the circumstances surrounding the incident. The investigation remains active and ongoing at this time. \n \n\n\nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Person Shot: Cleveland Avenue SW & I-75 Northbound Expressway SW","bodies":"Preliminary Statement: On October 28th, 2025, at approximately 3:24PM, officers responded to the area of Cleveland Avenue SW and the I-75 Northbound Expressway SW in reference to a person shot. Upon arrival, officers located a 32-year-old male who sustained an apparent gunshot wound to his left arm. The male was alert, conscious, breathing, and was attended to by medical personnel on scene. The preliminary investigation indicates that the male was attempting to sell water at the location when he engaged in a verbal dispute with an unidentified male suspect which escalated to gunfire. Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident. The investigation remains ongoing at this time.\nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Person Shot: Peachtree Center Ave. NE & Ellis St. NW","bodies":"Preliminary information: On October 28, 2025, at approximately 8:31 a.m., Atlanta Police Zone 5 officers responded to a report of a person shot at 33 Auditorium Pl. SE. Upon arriving on the scene, officers located a 36-year-old male victim who had sustained an apparent gunshot wound. The victim was alert, conscious, and breathing, and transported to the hospital by ambulance. Preliminary investigation indicates the male may have been shot near Peachtree Center Ave. NE & Ellis St. NW. Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident. The investigation continues.\n \nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Officer Involved Shooting: 2045 Donald Lee Hollowell Parkway NW","bodies":"Preliminary Statement: On October 27th, 2025, at approximately 6:13PM, officers responded to the Family Dollar located at 2045 Donald Lee Hollowell Parkway NW in reference to a criminal trespass. Upon arrival, the responding officer encountered an adult male. The responding officer attempted to question the male but the male fled from the location on foot and a foot chase ensued. The officer was able to locate the suspect at a nearby building at 2095 Donald Lee Hollowell Parkway NW. The preliminary investigation indicates that the male came toward the officer and the officer subsequently engaged the suspect in gunfire. The suspect was struck by the gunfire and fled on foot to 2080 Donald Lee Hollowell Parkway NW where he was given medical aid on scene by medical personnel and was later transported to a local hospital for treatment. The officer sustained minor injuries to her leg. Investigators with the Georgia Bureau of Investigation responded to the scene and will be leading the investigation. At this time, the investigation is ongoing.\n \nPress Conference: IMG_0148.mov \nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Officer Involved Shooting (OIS): 41 Irby Avenue NE","bodies":"Statement Update: Please be advised that our preliminary statement has been updated to include a photograph of the involved officer, Officer Gerald Walker, in an effort to maintain accuracy and to prevent misinformation from circulating on social media regarding this incident.\nPreviously Released: On October 11, 2025, at approximately 11:35 p.m., an Atlanta Police officer working an extra job responded to a request for assistance from security at 5 Paces Inn, located at 41 Irby Avenue NE, regarding a disruptive patron. The officer encountered the individual attempting to reenter the establishment from the back parking lot (3198 Caines Hill Place). The preliminary investigation indicates that the suspect was in possession of a firearm. Investigators with the GBI were notified and will be leading the investigation. The responding officer was not injured.\nPlease remember that the information released is limited and keep in mind, as the investigation progresses, the preliminary information could change, as is common with active investigations"},{"titles":"Person Shot: 464 Bishop St. NW","bodies":"Preliminary information: On October 26, 2025, at approximately 10:10 p.m., Atlanta Police Zone 2 officers responded to a report of gunfire at 464 Bishop St. NW. Shortly after, responding officers were notified that a person with a gunshot wound had arrived at Piedmont Hospital by private vehicle. At the hospital, officers located a 33-year-old male victim who had sustained an apparent gunshot wound. The victim was alert, conscious, and breathing.\n \nPreliminary investigation indicates the victim may have been sitting inside a vehicle in the parking deck at 464 Bishop St. NW when they heard gunfire and subsequently sustained their injury.\nInvestigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident.\nThe investigation continues.\n \nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Person Shot: 2126 Browns Mill Rd. SE","bodies":"Preliminary information: On October 25, 2025, at approximately 7:36 p.m., Atlanta Police Zone 3 officers responded to a report of a person shot at 2126 Browns Mill Rd. SE. Upon arriving on the scene, officers located a 21-year-old female victim who had sustained an apparent gunshot wound. The victim was alert, conscious, and breathing, and transported to the hospital by ambulance. Preliminary investigation indicates the victim may have been shot by a known suspect. Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident. The investigation continues.\n \nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Person Shot: 840 McDonough Blvd. SE","bodies":"Preliminary information: On October 25, 2025, at approximately 10:18 p.m., Atlanta Police Zone 6 officers responded to a report of a person shot at 746 Thomasville Blvd. SE. Upon arriving on the scene, officers located a 65-year-old male victim who had sustained multiple gunshot wounds. The victim was transported to the hospital by ambulance in stable condition. Preliminary investigation indicates the victim was seated in a vehicle at 840 McDonough Blvd. SE when he was approached by an unknown armed suspect and there was an exchange of gunfire. Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident. The investigation continues.\n \nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Person Shot: Pulliam St. SW & I-75/85 SB","bodies":"Preliminary information: On October 26, 2025, at approximately 1:59 a.m., Atlanta Police Zone 3 officers responded to Grady Hospital regarding a report of a person with a gunshot wound arriving at the hospital by private vehicle. At the hospital, officers located a 36-year-old female victim who had sustained an apparent gunshot wound. Preliminary investigation indicates the victim may have been shot during a road rage incident near Pulliam St. SW & I-75/85 SB. Investigators responded to the scene to determine the circumstances surrounding the incident. The investigation continues.\n \nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Preliminary Statement: Two People Shot, Arrests Made: 1193 Oakland Ln. SW","bodies":"Preliminary information: On October 26, 2025, at approximately 1:29 a.m., Atlanta Police Zone 4 officers responded to a report of a person shot at 1193 Oakland Ln. SW. Upon arriving in the scene, officers located a 33-year-old male who had sustained an apparent gunshot wound. The victim was transported to the hospital by ambulance in stable condition.\n \nWhile on the scene, officers were notified that there was a person shot at 1400 Lee St. SW. Upon arriving at that location, officers located a 26-year-old male who had sustained an apparent gunshot wound. The victim was alert, conscious, and breathing, and transported to the hospital by ambulance.\n \nPreliminary investigation indicates the two incidents were related and the original incident took place inside a residence at 1193 Oakland Ln. SW. Further investigation determined that a verbal argument between the two individuals who had been shot escalated to an exchange of gunfire. Both were taken into custody and charged with Aggravated Assault.\n \nThe individuals were identified as Deronte Cook (6/1999) and Hayes Henrico (9/1992).\n \nAll arrests and photos are public information. An arrest does not mean that the individual has been or will be convicted of the crime. Individuals on this press release/website/post/video are presumed innocent until proven guilty by a court of law.\n\nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information\n comes to light."},{"titles":"Multiple People Shot: 547 Martin Luther King Jr. Dr. NW","bodies":"Preliminary information: On October 25, 2025, at approximately 11:52 p.m., Atlanta Police Zone 1 officers responded to a report of a person shot near 547 Martin Luther King Jr. Dr. NW. Upon arriving on the scene, officers located a 19-year-old male, 18-year-old male, and a 17-year-old male who had all sustained apparent gunshot wounds. All victims were alert, conscious, and breathing, and transported to the hospital by ambulance. Preliminary investigation indicates the victims were standing outside near 547 Martin Luther King Jr. Dr. NW when they heard gunfire and subsequently sustained their injuries. Investigators responded to the scene to determine the circumstances surrounding the incident. The investigation continues.\n \nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Juvenile Shot: 3390 Fairburn Rd SW","bodies":"On Friday, October 24, 2025, at approximately 2:20 a.m., Atlanta police responded to a report of a person shot at 3390 Fairburn Rd SW. Upon arrival, officers located a male juvenile who had sustained a gunshot wound to his foot. During the preliminary investigation, the juvenile admitted that he was shot after he had broken into a vehicle. He was transported to Arthur M. Blank Children’s Hospital, alert, conscious, and breathing, for medical treatment.\n \nFurther investigation revealed that the vehicle owner had confronted the juvenile during the break-in. At that time, the vehicle owner fired at the juvenile, striking him in the foot. The owner, identified as 51-year-old Yoshay Carter, was taken into custody and charged with Aggravated Assault. He was later transported to the Fulton County Jail without incident. The investigation remains ongoing at this time.\n \nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light.\n\n \nAll arrests and photos are public information.  An arrest does not mean that the individual has been or will be convicted of the crime. Individuals on this press release/post/video are presumed innocent until proven guilty by a court of law"},{"titles":"Person Shot: 925 Conley RD SE","bodies":"Preliminary information: On October 23rd, 2025, at approximately 3:37 P.M., officers responded to reports of a person shot near 935 Conley RD SE. Upon arrival, officers located a 23-year-old male suffering from an apparent gunshot wound. The victim was alert, conscious, breathing, and was transported to the hospital. Preliminary investigation indicates the suspect fled the scene in a vehicle with a child inside, who was inside the vehicle at the time of the incident. Officers later located the vehicle and safely recovered the child near 3187 Donnebroook LN SE. The child did not appear to be injured, and medical personnel were on scene to assist. Investigators with the Aggravated Assault unit responded to the scene to investigate the circumstances surrounding the incident. The investigation remains ongoing. \n \nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light"},{"titles":"Update: Officer Involved Auto Accident: 560 James P. Brawley Dr NW & North Avenue NW","bodies":"911 Audio - Officer Involved Auto Accident - 560 James P. Brawley Dr. NW - 252931858.wav\n Officer Safi Department Photo\nHire Date: 05/9/2024\nSwear-in Date: 12/2024\nCurrent Assignment: Zone 1 Field Operations Division\nOfficer Safi is currently in the hospital recovering from serious injuries sustained from his accident. We ask that the media respect the privacy of Officer Safi, his colleagues, and family during his time of recovery.\nPreviously Released...\nPreliminary Statement: On October 20th, 2025, at approximately 8:15PM, while en route to an officer requesting assistance call, an Atlanta Police Zone 1 Patrol Officer was involved in an auto accident. The preliminary investigation indicates that the patrol vehicle left the roadway and struck a home located at 560 James P. Brawley Drive NW. The officer was extricated from his vehicle by several witnesses and was subsequently transported to the hospital with serious injuries. The auto accident resulted in a fire which was quickly suppressed by firefighters with the Atlanta Fire Rescue Department. There was one person inside of the home at the time of the auto accident, however, they were uninjured during the incident. The Georgia State Patrol will be conducting an investigation into the incident.\nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Z1_3 Joseph E Lowery Blvd NW_Aggravated Assault_252951815_102225","bodies":"252951815 \nPreliminary Information: On October 22, 2025, at approximately 6:10 p.m., officers were conducting a proactive enforcement investigation involving suspicious persons at 3 Joseph E. Lowery Boulevard NW. During their investigation, a male suspect displayed a firearm, fired one round toward the officers, and then fled the location on foot, entering what appeared to be an unoccupied property near 71 Newcastle Street NW.\nNo officers nor citizens were struck by gunfire, nor did any officers discharge their service weapons. Officers engaged in a foot pursuit leading to the unoccupied home, where the suspect was still believed to be inside. A perimeter was established, and officers requested additional units for special assistance. The APD S.W.A.T. Unit, K-9 Unit, Homicide Unit, and Drone Unit responded to the scene. S.W.A.T. units made a successful entry into the home and around the immediate perimeter, and a 16-year-old juvenile male was located hiding in the Woodline near the unoccupied property. He was taken into custody without incident. Multiple charges are pending at this time as the investigation continues.\n \nPlease keep in mind the above information is preliminary in nature and can change as the investigation progresses and new information comes to light."},{"titles":"Person Shot: 440 Latta ST. NE","bodies":"Preliminary information: On October 22, 2025, at approximately 5:32 P.M., Atlanta Police Zone 6 officers responded to reports of a person shot near 440 Latta Street NE. Upon arrival, they located an 18-year-old male suffering from an apparent gunshot wound to the back. The victim was transported to the hospital by ambulance in critical condition. Officers later learned of a second victim, a 26-year-old male, who had sustained an apparent gunshot wound. He arrived at Emory Hospital by private vehicle and is alert, conscious, and breathing. Investigators responded to the scene to determine the circumstances surrounding the incident. The investigation remains ongoing.\n \nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Aggravated Assault: 635 Lindbergh Dr NE","bodies":"252932036\nPreliminary Information: On 10/20/25, around 11:15pm, officers responded to 635 Lindbergh Dr NE in reference to a person shot. Upon arrival, officers located a male victim with a gunshot wound to the leg. He was alert, conscious and breathing and transported to the hospital for treatment by EMS services. Preliminary investigation indicates the victim heard a dispute between a male and a female, possibly coming from a vehicle. The victim stated he then heard a gunshot then found himself struck in the leg. Investigators are working to determine the circumstances surrounding the incident. The investigation continues. \n \nPlease keep in mind the above information is preliminary in nature and can change as the investigation progresses and new information comes to light."},{"titles":"Update: Death Investigation: I-75 NB & Northside Dr. NW","bodies":"Investigation Update – October 20, 2025\n \nFurther investigation determined the 21-year-old male victim may have been shot during road rage incident and subsequently struck by two vehicles, including an Atlanta Police patrol vehicle, that was unaware of the original incident. \n \nThe Atlanta Police Department’s Homicide Unit is leading the investigation into the potential road rage shooting and Georgia State Patrol is leading the investigation into the pedestrian accidents.\n \nThe other involved party in the shooting remained on the scene and is cooperating with the investigation.\n \nThe investigation remains active and ongoing.\n \nPreliminary Statement - October 19, 2025\n \n On October 18, 2025, at approximately 10:20 p.m., Atlanta Police Zone 2 officers patrolling on I-75 NB near Northside Dr. NW discovered a 21-year-old male victim lying in the roadway. Responding medical personnel pronounced the victim deceased on the scene. Investigators with the Homicide Unit responded to the scene to determine the circumstances surrounding the incident. The official cause and manner of death will be determined by an autopsy by the Fulton County medical Examiner’s Office. The investigation continues.\n \nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."}]