[
    {
        "titles": "Person Shot: 367 Edgewood AVE. SE",
        "bodies": "<div data-olk-copy-source=\"MessageBody\">Preliminary information: On November 1, 2025, at approximately 12:40 a.m., Atlanta Police Zone 6 officers responded to reports of a person shot at 367 Edgewood Avenue SE. Upon arrival, officers located a 31-year-old male victim suffering from an apparent gunshot wound to the left shoulder. The victim was alert, conscious, and breathing, and was transported to the hospital by ambulance for treatment.</div>\n<div>&nbsp;</div>\n<div>Preliminary investigation indicates the victim was a passenger in a vehicle traveling westbound on Edgewood Avenue when the vehicle was struck by gunfire. Investigators with the Aggravated Assault Unit are working to determine the circumstances surrounding the incident. The investigation remains ongoing.</div>\n<div>&nbsp;</div>\n<div><strong>Please keep in mind that the information released is&nbsp;preliminary&nbsp;in nature and could change as the&nbsp;investigation progresses or new information comes to light.</strong></div>"
    },
    {
        "titles": "Person Shot: 448 Boulevard SE",
        "bodies": "<div data-olk-copy-source=\"MessageBody\">Preliminary information: On October 31, 2025, at approximately 11:32 p.m., Atlanta Police Zone 6 officers responded to a report of a person shot at 448 Boulevard SW. Upon arriving on the scene, officers located a 19-year-old male victim who had sustained an apparent gunshot wound. The victim was alert, conscious, and breathing, and transported to the hospital by ambulance. Officers later learned of another 19-year-old male who self-transported to the hospital who sustained an apparent gunshot wound. The victim was alert, conscious and breathing. Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident. The investigation continues.</div>\n<div>&nbsp;</div>\n<div>Please keep in mind that the information released is&nbsp;preliminary&nbsp;in nature and could change as the&nbsp;investigation progresses or new information comes to light.</div>\n<div></div>"
    },
    {
        "titles": "Attempted Security Breach: Hartsfield-Jackson Atlanta International Airport",
        "bodies": "<div data-olk-copy-source=\"MessageBody\">Preliminary information: On October 30, 2025, at approximately 8:28 a.m., Atlanta Police responded to a report of an attempted security breach near the main security checkpoint at Hartsfield-Jackson Atlanta International Airport. Before officers’ arrival, the suspect had been stopped by a civilian and TSA agents before the checkpoint was breached. The suspect was taken into custody by Atlanta Police without further incident, and he was identified as Leon Fabian (3/1985). No injuries were reported from the incident, and there were no disruptions to airport services.&nbsp;Mr. Fabian has been charged with Simple Battery and Avoiding or Interfering with Security Measures.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">All arrests are public information. An arrest does not mean that the individual has been or will be convicted of the crime. Individuals on this press release/website/post/video are presumed innocent until proven guilty by a court of law.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">Please keep in mind that the information released is preliminary in nature and could change as the&nbsp;investigation progresses or new information comes to light.</div>"
    },
    {
        "titles": "Arrest Update: Homicide: 55 Pharr Rd. NW",
        "bodies": "<div data-olk-copy-source=\"MessageBody\">Preliminary information: On October 30, 2025, at approximately 12:22 a.m., Atlanta Police Zone 2 officers responded to a report of a dispute at 55 Pharr Rd. NW. Upon arriving on the scene, officers made contact with a 32-year-old female and a 32-year-old male. While on scene, a 54-year-old male arrived and left with the 32-year-old male.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">While officers were speaking with the female, they heard gunfire from the parking lot. Officers responded and located the 32-year-old male with an apparent gunshot wound. Responding medical personnel pronounced the victim deceased on the scene. Officers detained the 54-year-old male on the scene. Preliminary information indicates the two males may be related.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">The 54-year-old male suspect was identified as&nbsp;<b>Durante Tolliver</b>&nbsp;(8/1971). Mr. Tolliver has been charged with Murder, Aggravated Assault, and Possession of a Firearm During the Commission of a Felony.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">Please keep in mind that the information released is preliminary in nature and could change as the&nbsp;investigation progresses or new information comes to light.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\"><i>All arrests are&nbsp;public information. An arrest does not mean that the individual has been or will be convicted of the crime. Individuals on this press release/website/post/video are presumed&nbsp;innocent&nbsp;until&nbsp;proven&nbsp;guilty&nbsp;by a court of law.</i></div>"
    },
    {
        "titles": "Person Shot: 817 Eloise Ct. SE",
        "bodies": "<div data-olk-copy-source=\"MessageBody\">Preliminary information: On October 30, 2025, at approximately 2:12 a.m., Atlanta Police Zone 6 officers responded to a report of a person shot at 817 Eloise Ct. SE. Upon arriving on the scene, offices spoke with a male who identified himself as the shooter. The male is cooperating with the investigation</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">While on the scene, officers were notified that a person with gunshot wound had arrived at the hospital by private vehicle. At the hospital, officers located a 28-year-old male who had sustained an apparent gunshot wound. The male was alert, conscious, and breathing.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">Preliminary investigation indicates that a verbal dispute escalated to gunfire.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">General Crimes investigators responded to the scene to determine the circumstances surrounding the incident. The investigation continues.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">Please keep in mind that the information released is preliminary in nature and could change as the&nbsp;investigation progresses or new information comes to light.</div>"
    },
    {
        "titles": "Fatal shooting: 2500 Center St NW",
        "bodies": "<div>Preliminary information: On Wednesday, October 29, 2025, at around 8:56 AM, Atlanta police were dispatched to a person shot call at 2500 Center St NW. Upon their arrival, they located a female inside of a vehicle with an apparent gunshot wound to her head. She was transported to the hospital&nbsp;where she was pronounced deceased.&nbsp;Investigators with the Homicide Unit will be responding to the scene to determine the circumstances surrounding the incident. The investigation remains active and ongoing at this time.&nbsp;</div>\n<p>&nbsp;</p>\n<div id=\"x_Signature\">\n<div></div>\n<div><b>Please keep in mind that the information released is preliminary in nature and could change as the</b>&nbsp;<b>investigation progresses or new information comes to light.</b></div>\n</div>"
    },
    {
        "titles": "Person Shot: Cleveland Avenue SW & I-75 Northbound Expressway SW",
        "bodies": "<p>Preliminary Statement: On October 28th, 2025, at approximately 3:24PM, officers responded to the area of Cleveland Avenue SW and the I-75 Northbound Expressway SW&nbsp;in reference to a&nbsp;person&nbsp;shot. Upon arrival, officers located a 32-year-old male who sustained an apparent gunshot wound to his left arm. The male was alert, conscious, breathing, and was attended to by medical personnel on scene. The preliminary investigation indicates that the male was attempting to sell water at the location when he engaged in a verbal dispute with an unidentified male suspect which escalated to gunfire. Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident. The investigation remains ongoing at this time.</p>\n<p><span data-olk-copy-source=\"MessageBody\">Please keep in mind that the information released is preliminary in nature and could change as the</span>&nbsp;investigation progresses or new information comes to light.</p>"
    },
    {
        "titles": "Person Shot: Peachtree Center Ave. NE & Ellis St. NW",
        "bodies": "<div data-olk-copy-source=\"MessageBody\">Preliminary information: On October 28, 2025, at approximately 8:31 a.m., Atlanta Police Zone 5 officers responded to a report of a person shot at 33 Auditorium Pl. SE. Upon arriving on the scene, officers located a 36-year-old male victim who had sustained an apparent gunshot wound. The victim was alert, conscious, and breathing, and transported to the hospital by ambulance. Preliminary investigation indicates the male may have been shot near Peachtree Center Ave. NE &amp; Ellis St. NW. Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident. The investigation continues.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">Please keep in mind that the information released is preliminary in nature and could change as the&nbsp;investigation progresses or new information comes to light.</div>"
    },
    {
        "titles": "Officer Involved Shooting: 2045 Donald Lee Hollowell Parkway NW",
        "bodies": "<div data-olk-copy-source=\"MessageBody\">Preliminary Statement: On October 27th, 2025, at approximately 6:13PM, officers responded to the Family Dollar located at 2045 Donald Lee Hollowell Parkway NW in reference to a criminal trespass. Upon arrival, the responding officer encountered an adult male. The responding officer attempted to question the male but the male fled from the location on foot and a foot chase ensued. The officer was able to locate the suspect at a nearby building at 2095 Donald Lee Hollowell Parkway NW. The preliminary investigation indicates that the male came toward the officer and the officer subsequently engaged the suspect in gunfire. The suspect was struck by the gunfire and fled on foot to 2080 Donald Lee Hollowell Parkway NW where he was given medical aid on scene by medical personnel and was later transported to a local hospital for treatment. The officer sustained minor injuries to her leg. Investigators with the Georgia Bureau of Investigation responded to the scene and will be leading the investigation. At this time, the investigation is ongoing.</div>\n<p data-olk-copy-source=\"MessageBody\">&nbsp;</p>\n<p data-olk-copy-source=\"MessageBody\">Press Conference:&nbsp;<a data-loopstyle=\"link\" data-unfurl-id=\"unfurl-id-28a06734-5db8-4e46-b78b-0c061674a62a\" tabindex=\"0\" id=\"x_ms-outlook-mobile-sharing-link-anchor-be3431c1-9555-4b4e-9879-89a4e410d7d8\" originalsrc=\"https://cityofatlanta-my.sharepoint.com/:v:/g/personal/afix_atlantaga_gov/Ec4PyD2xvW1OunS21abdrecBXMJaO7c7sryHdebs6bXc7g\" data-auth=\"NotApplicable\" rel=\"noreferrer noopener\" target=\"_blank\" href=\"https://cityofatlanta-my.sharepoint.com/:v:/g/personal/afix_atlantaga_gov/Ec4PyD2xvW1OunS21abdrecBXMJaO7c7sryHdebs6bXc7g?xsdata=MDV8MDJ8YWZpeEBBdGxhbnRhR2EuR292fDc4YjI0MTQxYjdkNTQ0NGIxNDgzMDhkZTE1ZTY5YWY1fDAzMWE1NTBhZjFmMzRiNjI5YzY0M2VmMDJjNzc5OGE1fDB8MHw2Mzg5NzIyNzczNzUyNDYxODN8VW5rbm93bnxUV0ZwYkdac2IzZDhleUpGYlhCMGVVMWhjR2tpT25SeWRXVXNJbFlpT2lJd0xqQXVNREF3TUNJc0lsQWlPaUpYYVc0ek1pSXNJa0ZPSWpvaVRXRnBiQ0lzSWxkVUlqb3lmUT09fDB8fHw%3d&amp;sdata=ZGJ0dzY0ck9jWldTc0VaN0p4b1AwUktkZlEzMDNQbGFWV1BuUmRBVDdkND0%3d\" data-linkindex=\"0\" title=\"Original URL: https://cityofatlanta-my.sharepoint.com/:v:/g/personal/afix_atlantaga_gov/Ec4PyD2xvW1OunS21abdrecBXMJaO7c7sryHdebs6bXc7g. Click or tap if you trust this link.\">IMG_0148.mov</a>&nbsp;</p>\n<p data-olk-copy-source=\"MessageBody\"><span data-olk-copy-source=\"MessageBody\">Please keep in mind that the information released is preliminary in nature and could change as the</span>&nbsp;investigation progresses or new information comes to light.</p>"
    },
    {
        "titles": "Officer Involved Shooting (OIS): 41 Irby Avenue NE",
        "bodies": "<p><strong><b data-olk-copy-source=\"MessageBody\">Statement Update:</b>&nbsp;</strong>Please be advised that our preliminary statement has been updated to include a photograph of the involved officer, Officer Gerald Walker, in an effort to maintain accuracy and to prevent misinformation from circulating on social media regarding this incident.</p>\n<p><b data-olk-copy-source=\"MessageBody\">Previously Released:</b>&nbsp;On October 11, 2025, at approximately 11:35 p.m., an Atlanta Police officer working an extra job responded to a request for assistance from security at 5 Paces Inn, located at 41 Irby Avenue NE, regarding a disruptive patron. The officer encountered the individual attempting to reenter the establishment from the back parking lot (3198 Caines Hill Place). The preliminary investigation indicates that the suspect was in possession of a firearm. Investigators with the GBI were notified and will be leading the investigation. The responding officer was not injured.</p>\n<p><i>Please remember that the information released is limited and keep in mind, as the investigation progresses, the preliminary information could change, as is common with active investigations</i><i><img src=\"/home/showpublishedimage/4544/638971855728270000\" alt=\"GERALD WALKER\" style=\"margin:15px;\"></i></p>\n<p><i></i></p>"
    },
    {
        "titles": "Person Shot: 464 Bishop St. NW",
        "bodies": "<div data-olk-copy-source=\"MessageBody\">Preliminary information: On October 26, 2025, at approximately 10:10 p.m., Atlanta Police Zone 2 officers responded to a report of gunfire at 464 Bishop St. NW. Shortly after, responding officers were notified that a person with a gunshot wound had arrived at Piedmont Hospital by private vehicle. At the hospital, officers located a 33-year-old male victim who had sustained an apparent gunshot wound. The victim was alert, conscious, and breathing.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">Preliminary investigation indicates the victim may have been sitting inside a vehicle in the parking deck at 464 Bishop St. NW when they heard gunfire and subsequently sustained their injury.</div>\n<div>Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident.</div>\n<div>The investigation continues.</div>\n<div>&nbsp;</div>\n<div>Please keep in mind that the information released is preliminary in nature and could change as the&nbsp;investigation progresses or new information comes to light.</div>"
    },
    {
        "titles": "Person Shot: 2126 Browns Mill Rd. SE",
        "bodies": "<div data-olk-copy-source=\"MessageBody\">Preliminary information: On October 25, 2025, at approximately 7:36 p.m., Atlanta Police Zone 3 officers responded to a report of a person shot at 2126 Browns Mill Rd. SE. Upon arriving on the scene, officers located a 21-year-old female victim who had sustained an apparent gunshot wound. The victim was alert, conscious, and breathing, and transported to the hospital by ambulance. Preliminary investigation indicates the victim may have been shot by a known suspect. Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident. The investigation continues.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">Please keep in mind that the information released is preliminary in nature and could change as the&nbsp;investigation progresses or new information comes to light.</div>"
    },
    {
        "titles": "Person Shot: 840 McDonough Blvd. SE",
        "bodies": "<div data-olk-copy-source=\"MessageBody\">Preliminary information: On October 25, 2025, at approximately 10:18 p.m., Atlanta Police Zone 6 officers responded to a report of a person shot at 746 Thomasville Blvd. SE. Upon arriving on the scene, officers located a 65-year-old male victim who had sustained multiple gunshot wounds. The victim was transported to the hospital by ambulance in stable condition. Preliminary investigation indicates the victim was seated in a vehicle at 840 McDonough Blvd. SE when he was approached by an unknown armed suspect and there was an exchange of gunfire. Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident. The investigation continues.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">Please keep in mind that the information released is preliminary in nature and could change as the&nbsp;investigation progresses or new information comes to light.</div>"
    },
    {
        "titles": "Person Shot: Pulliam St. SW & I-75/85 SB",
        "bodies": "<div data-olk-copy-source=\"MessageBody\">Preliminary information: On October 26, 2025, at approximately 1:59 a.m., Atlanta Police Zone 3 officers responded to Grady Hospital regarding a report of a person with a gunshot wound arriving at the hospital by private vehicle. At the hospital, officers located a 36-year-old female victim who had sustained an apparent gunshot wound. Preliminary investigation indicates the victim may have been shot during a road rage incident near Pulliam St. SW &amp; I-75/85 SB. Investigators responded to the scene to determine the circumstances surrounding the incident. The investigation continues.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">Please keep in mind that the information released is preliminary in nature and could change as the&nbsp;investigation progresses or new information comes to light.</div>"
    },
    {
        "titles": "Preliminary Statement: Two People Shot, Arrests Made: 1193 Oakland Ln. SW",
        "bodies": "<div data-olk-copy-source=\"MessageBody\">Preliminary information: On October 26, 2025, at approximately 1:29 a.m., Atlanta Police Zone 4 officers responded to a report of a person shot at 1193 Oakland Ln. SW. Upon arriving in the scene, officers located a 33-year-old male who had sustained an apparent gunshot wound. The victim was transported to the hospital by ambulance in stable condition.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">While on the scene, officers were notified that there was a person shot at 1400 Lee St. SW. Upon arriving at that location, officers located a 26-year-old male who had sustained an apparent gunshot wound. The victim was alert, conscious, and breathing, and transported to the hospital by ambulance.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">Preliminary investigation indicates the two incidents were related and the original incident took place inside a residence at 1193 Oakland Ln. SW. Further investigation determined that a verbal argument between the two individuals who had been shot escalated to an exchange of gunfire. Both were taken into custody and charged with Aggravated Assault.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">The individuals were identified as&nbsp;<b>Deronte Cook</b>&nbsp;(6/1999) and&nbsp;<b>Hayes Henrico</b>&nbsp;(9/1992).</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\"><i>All arrests and photos are public information. An arrest does not mean that the individual has been or will be convicted of the crime. Individuals on this press release/website/post/video are presumed&nbsp;innocent&nbsp;until&nbsp;proven&nbsp;guilty&nbsp;by a court of law.</i></div>\n<div></div>\n<div>Please keep in mind that the information released is preliminary in nature and could change as the&nbsp;investigation progresses or new information</div>\n<div>&nbsp;comes to light.</div>"
    },
    {
        "titles": "Multiple People Shot: 547 Martin Luther King Jr. Dr. NW",
        "bodies": "<div data-olk-copy-source=\"MessageBody\">Preliminary information: On October 25, 2025, at approximately 11:52 p.m., Atlanta Police Zone 1 officers responded to a report of a person shot near 547 Martin Luther King Jr. Dr. NW. Upon arriving on the scene, officers located a 19-year-old male, 18-year-old male, and a 17-year-old male who had all sustained apparent gunshot wounds. All victims were alert, conscious, and breathing, and transported to the hospital by ambulance. Preliminary investigation indicates the victims were standing outside near 547 Martin Luther King Jr. Dr. NW when they heard gunfire and subsequently sustained their injuries. Investigators responded to the scene to determine the circumstances surrounding the incident. The investigation continues.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">Please keep in mind that the information released is preliminary in nature and could change as the&nbsp;investigation progresses or new information&nbsp;comes to light.</div>"
    },
    {
        "titles": "Juvenile Shot: 3390 Fairburn Rd SW",
        "bodies": "<div data-olk-copy-source=\"MessageBody\">On Friday, October 24, 2025, at approximately 2:20 a.m., Atlanta police responded to a report of a person shot at 3390 Fairburn Rd SW. Upon arrival, officers located a male juvenile who had sustained a gunshot wound to his foot. During the preliminary investigation, the juvenile admitted that he was shot after he had broken into a vehicle. He was transported to Arthur M. Blank Children’s Hospital, alert, conscious, and breathing, for medical treatment.</div>\n<div>&nbsp;</div>\n<div>Further investigation revealed that the vehicle owner had confronted the juvenile during the break-in. At that time, the vehicle owner fired at the juvenile, striking him in the foot. The owner, identified as 51-year-old Yoshay Carter, was taken into custody and charged with Aggravated Assault. He was later transported to the Fulton County Jail without incident. The investigation remains ongoing at this time.</div>\n<div><b>&nbsp;</b></div>\n<div><b>Please keep in mind that the information released is preliminary in nature and could change as the</b>&nbsp;<b>investigation progresses or new information comes to light.</b></div>\n<div id=\"x_Signature\">\n<p><strong>&nbsp;</strong></p>\n<p><strong>All arrests and photos are public information.&nbsp; An arrest does not mean that the individual has been or will be convicted of the crime. Individuals on this press release/post/video are presumed innocent until proven guilty by a court of law</strong></p>\n</div>"
    },
    {
        "titles": "Person Shot: 925 Conley RD SE",
        "bodies": "<div data-olk-copy-source=\"MessageBody\">Preliminary information: On October 23rd, 2025, at approximately 3:37 P.M., officers responded to reports of a person shot near 935 Conley RD SE. Upon arrival, officers located a 23-year-old male suffering from an apparent gunshot wound. The victim was alert, conscious, breathing, and was transported to the hospital. Preliminary investigation indicates the suspect fled the scene in a vehicle with a child inside, who was inside the vehicle at the time of the incident. Officers later located the vehicle and safely recovered the child near 3187 Donnebroook LN SE. The child did not appear to be injured, and medical personnel were on scene to assist. Investigators with the Aggravated Assault unit responded to the scene to investigate the circumstances surrounding the incident. The investigation remains ongoing.&nbsp;</div>\n<p data-olk-copy-source=\"MessageBody\"><strong>&nbsp;</strong></p>\n<div><strong>Please keep in mind that the information released is&nbsp;preliminary&nbsp;in nature and could change as the investigation progresses or new information comes to light</strong></div>"
    }
]