[{"titles":"11/7/25: Aggravated Assault: 3021 Margaret Mitchell Dr NW","bodies":"<p>253102277</p>\n<p>Preliminary Information: On 11/6/25 around 11:47pm, officers responded to a person shot at the location of 3021 Margaret Mitchell Dr NW. Upon arrival, officers located a male with a graze wound to the shoulder. Grady EMS responded to the scene and transported the victim to the hospital for treatment. Preliminary investigation indicates the victim was inside his home when what appeared to be a stray round entered his window and grazed him in the shoulder. Investigators are working to determine the circumstances surrounding the incident. The investigation continues. </p>\n<p><b>&nbsp;</b></p>\n<p><b>Please keep in mind the above information is preliminary in nature and can change as the investigation progresses and new information comes to light.&nbsp;</b></p>"},{"titles":"Person Stabbed: 98 William H Borders DR SE","bodies":"<p>Preliminary&nbsp;Statement: On November 6th, 2025, at approximately 6:02 P.M., officers responded to 556 Magnolia ST NW in reference to a&nbsp;person&nbsp;stabbed. Upon arrival, officers located a female who sustained an apparent stab wound. The female was alert, conscious, breathing, and was transported to the hospital for treatment. Preliminary investigation indicates the incident occurred near 98 William H Borders DR SE, where a dispute ensued and the victim was struck by a vehicle before being stabbed. Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident. The investigation remains ongoing at this time.</p>\n<p><strong>Please keep in mind that the information released is preliminary in nature and could change as the&nbsp;investigation progresses or new information comes to light.</strong></p>"},{"titles":"Fatal Traffic Accident: 2251 Marietta BLVD. NW","bodies":"<p>Preliminary Information: On 11/5/25, around 7:13am, officers responded to 2251 Marietta Blvd NW in reference to a traffic accident. Upon arrival, officers located a cement truck turned over within an embankment. Grady and Fire responded to the scene and located a male driver inside. The male was extricated and transported to Grady hospital where he was later pronounced deceased. Preliminary investigation indicates the vehicle was traveling northbound on Marietta Blvd when the driver suddenly veered off the roadway. The vehicle struck an electric pole, went over the divider, and landed on its side in an embankment. The APD Accident Investigations Unit responded to the scene to investigation the circumstances surrounding the incident. The investigation remains ongoing.</p>\n<p><b>Please keep in mind the above information is preliminary in nature and can change as the investigation progresses and new information comes to light.</b></p>"},{"titles":"11/5/25: Aggravated Assault: 1047 Gun Club Rd NW","bodies":"<p>253090191</p>\n<p>Preliminary Information: On 11/5/25, around 2:35am, officers responded to 1047 Gun Club Rd NW in reference to a person shot. Upon arrival, officers located a female victim with gunshot wounds to her lower extremities. Medical personnel transported the victim to the hospital for treatment. Preliminary information indicates the victim was sleeping in her home with several shots were fired into the home, striking her in the legs. The shooting appears to have occurred from an ongoing dispute between neighbors. Investigators are working to determine the circumstances surrounding the incident. The investigation continues. </p>\n<p>&nbsp;</p>\n<p><b>Please keep in mind the above information is preliminary in nature and can change as the investigation progresses and new information comes to light.</b></p>\n<p>&nbsp;</p>"},{"titles":"11/5/25: Death Investigation: 210 Auburn Ave NE","bodies":"<p>253090012</p>\n<p>Preliminary Information: On 11/5/25, around 12:07am, officers responded to a person shot call at the location of 210 Auburn Ave NE. Upon arrival, officers located a male with multiple gunshot wound. Grady EMS responded to the scene and was transported to the hospital where he was later pronounced deceased. While officers were on scene at Grady, an additional male arrived at Grady with gunshot wounds. He was immediately taken into treatment. He was last reported to be in stable condition. Homicide investigators responded to the scene and are working to determine the circumstances, surrounding the incident. The investigation continues. </p>\n<p>&nbsp;</p>\n<p><b>Please keep in mind the above information is preliminary in nature and can change as the investigation progresses and new information comes to light.</b></p>"},{"titles":"Person Shot: 294 Joseph E. Lowery Boulevard NW","bodies":"<p>Preliminary Statement: On November 3rd, 2025, at approximately 8:51PM, officers responded to 294 Joseph E. Lowery Boulevard NW in reference to a person shot. Upon arrival, officers located a 17-year-old male who sustained an apparent gunshot wound to his right leg. The male was alert, conscious, breathing, and was transported to the hospital for treatment. The preliminary investigation indicates that the male was in a verbal altercation with an unidentified male suspect which escalated to gunfire. Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident. The investigation remains ongoing at this time.</p>\n<p><span data-olk-copy-source=\"MessageBody\">Please keep in mind that the information released is preliminary in nature and could change as the</span>&nbsp;investigation progresses or new information comes to light.</p>"},{"titles":"Arrest Update: Fatal Shooting: 2500 Center Street NW","bodies":"<div>\n<div><b data-olk-copy-source=\"MessageBody\">Arrest Update:</b></div>\n<div>On November 3rd, 2025, 29-year-old Durrell Dorsey was taken into custody by the Atlanta Police Department for his involvement in a homicide that occurred at 2500 Center Street NW on October 29th, 2025. Mr. Dorsey is being charged with Murder, Aggravated Assault (2 Counts), Possession of a Firearm During the Commission of a Felony, and Possession of a Firearm By a Convicted Felon. Mr. Dorsey was transported to the Fulton County Jail for processing.</div>\n<div></div>\n<div><b>Previously Released:</b></div>\n<div>Preliminary Statement: On Wednesday, October 29, 2025, at around 8:56 AM, Atlanta police were dispatched to a person shot call at 2500 Center St NW. Upon their arrival, they located a female inside of a vehicle with an apparent gunshot wound to her head. She was transported to the hospital&nbsp;where she was pronounced deceased.&nbsp;Investigators with the Homicide Unit will be responding to the scene to determine the circumstances surrounding the incident. The investigation remains active and ongoing at this time.&nbsp;</div>\n</div>\n<div id=\"x_Signature\">\n<div></div>\n<div><b>&nbsp;</b></div>\n<div>Please keep in mind that the information released is preliminary in nature and could change as the&nbsp;investigation progresses or new information comes to light.</div>\n</div>"},{"titles":"Person Stabbed: 320 Augusta Avenue SE","bodies":"<p>Preliminary Statement: On November 3rd, 2025, at approximately 2:53PM, officers responded to the area of 320 Augusta Avenue SE&nbsp;in reference to a&nbsp;person&nbsp;stabbed. Upon arrival, officers located a 75-year-old male who sustained an apparent stab wound to his abdomen. The male was not alert or conscious but was breathing, and was transported to the hospital for treatment. Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident. The investigation remains ongoing at this time.</p>\n<p><span data-olk-copy-source=\"MessageBody\">Please keep in mind that the information released is preliminary in nature and could change as the</span>&nbsp;investigation progresses or new information comes to light.</p>"},{"titles":"Person Shot: 1162 Joseph E. Boone Blvd. NW","bodies":"<div data-olk-copy-source=\"MessageBody\">Preliminary information: On November 2, 2025, at approximately 7:27 a.m., Atlanta Police Zone 1 officers responded to a report of a person shot near 1198 Joseph E. Boone Blvd. NW. Upon arriving on the scene, officers located a vehicle that had struck a utility pole. Inside the vehicle, they discovered a 59-year-old male victim who had sustained apparent gunshot wounds. The victim was transported to the hospital by ambulance in critical condition. Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident. The investigation continues.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">Please keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light.&nbsp;&nbsp;</div>"},{"titles":"Person Shot: 367 Edgewood AVE. SE","bodies":"<div data-olk-copy-source=\"MessageBody\">Preliminary information: On November 1, 2025, at approximately 12:40 a.m., Atlanta Police Zone 6 officers responded to reports of a person shot at 367 Edgewood Avenue SE. Upon arrival, officers located a 31-year-old male victim suffering from an apparent gunshot wound to the left shoulder. The victim was alert, conscious, and breathing, and was transported to the hospital by ambulance for treatment.</div>\n<div>&nbsp;</div>\n<div>Preliminary investigation indicates the victim was a passenger in a vehicle traveling westbound on Edgewood Avenue when the vehicle was struck by gunfire. Investigators with the Aggravated Assault Unit are working to determine the circumstances surrounding the incident. The investigation remains ongoing.</div>\n<div>&nbsp;</div>\n<div><strong>Please keep in mind that the information released is&nbsp;preliminary&nbsp;in nature and could change as the&nbsp;investigation progresses or new information comes to light.</strong></div>"},{"titles":"Person Shot: 448 Boulevard SE","bodies":"<div data-olk-copy-source=\"MessageBody\">Preliminary information: On October 31, 2025, at approximately 11:32 p.m., Atlanta Police Zone 6 officers responded to a report of a person shot at 448 Boulevard SW. Upon arriving on the scene, officers located a 19-year-old male victim who had sustained an apparent gunshot wound. The victim was alert, conscious, and breathing, and transported to the hospital by ambulance. Officers later learned of another 19-year-old male who self-transported to the hospital who sustained an apparent gunshot wound. The victim was alert, conscious and breathing. Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident. The investigation continues.</div>\n<div>&nbsp;</div>\n<div>Please keep in mind that the information released is&nbsp;preliminary&nbsp;in nature and could change as the&nbsp;investigation progresses or new information comes to light.</div>\n<div></div>"},{"titles":"Attempted Security Breach: Hartsfield-Jackson Atlanta International Airport","bodies":"<div data-olk-copy-source=\"MessageBody\">Preliminary information: On October 30, 2025, at approximately 8:28 a.m., Atlanta Police responded to a report of an attempted security breach near the main security checkpoint at Hartsfield-Jackson Atlanta International Airport. Before officers’ arrival, the suspect had been stopped by a civilian and TSA agents before the checkpoint was breached. The suspect was taken into custody by Atlanta Police without further incident, and he was identified as Leon Fabian (3/1985). No injuries were reported from the incident, and there were no disruptions to airport services.&nbsp;Mr. Fabian has been charged with Simple Battery and Avoiding or Interfering with Security Measures.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">All arrests are public information. An arrest does not mean that the individual has been or will be convicted of the crime. Individuals on this press release/website/post/video are presumed innocent until proven guilty by a court of law.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">Please keep in mind that the information released is preliminary in nature and could change as the&nbsp;investigation progresses or new information comes to light.</div>"},{"titles":"Arrest Update: Homicide: 55 Pharr Rd. NW","bodies":"<div data-olk-copy-source=\"MessageBody\">Preliminary information: On October 30, 2025, at approximately 12:22 a.m., Atlanta Police Zone 2 officers responded to a report of a dispute at 55 Pharr Rd. NW. Upon arriving on the scene, officers made contact with a 32-year-old female and a 32-year-old male. While on scene, a 54-year-old male arrived and left with the 32-year-old male.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">While officers were speaking with the female, they heard gunfire from the parking lot. Officers responded and located the 32-year-old male with an apparent gunshot wound. Responding medical personnel pronounced the victim deceased on the scene. Officers detained the 54-year-old male on the scene. Preliminary information indicates the two males may be related.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">The 54-year-old male suspect was identified as&nbsp;<b>Durante Tolliver</b>&nbsp;(8/1971). Mr. Tolliver has been charged with Murder, Aggravated Assault, and Possession of a Firearm During the Commission of a Felony.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">Please keep in mind that the information released is preliminary in nature and could change as the&nbsp;investigation progresses or new information comes to light.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\"><i>All arrests are&nbsp;public information. An arrest does not mean that the individual has been or will be convicted of the crime. Individuals on this press release/website/post/video are presumed&nbsp;innocent&nbsp;until&nbsp;proven&nbsp;guilty&nbsp;by a court of law.</i></div>"},{"titles":"Person Shot: 817 Eloise Ct. SE","bodies":"<div data-olk-copy-source=\"MessageBody\">Preliminary information: On October 30, 2025, at approximately 2:12 a.m., Atlanta Police Zone 6 officers responded to a report of a person shot at 817 Eloise Ct. SE. Upon arriving on the scene, offices spoke with a male who identified himself as the shooter. The male is cooperating with the investigation</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">While on the scene, officers were notified that a person with gunshot wound had arrived at the hospital by private vehicle. At the hospital, officers located a 28-year-old male who had sustained an apparent gunshot wound. The male was alert, conscious, and breathing.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">Preliminary investigation indicates that a verbal dispute escalated to gunfire.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">General Crimes investigators responded to the scene to determine the circumstances surrounding the incident. The investigation continues.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">Please keep in mind that the information released is preliminary in nature and could change as the&nbsp;investigation progresses or new information comes to light.</div>"},{"titles":"Person Shot: Cleveland Avenue SW & I-75 Northbound Expressway SW","bodies":"<p>Preliminary Statement: On October 28th, 2025, at approximately 3:24PM, officers responded to the area of Cleveland Avenue SW and the I-75 Northbound Expressway SW&nbsp;in reference to a&nbsp;person&nbsp;shot. Upon arrival, officers located a 32-year-old male who sustained an apparent gunshot wound to his left arm. The male was alert, conscious, breathing, and was attended to by medical personnel on scene. The preliminary investigation indicates that the male was attempting to sell water at the location when he engaged in a verbal dispute with an unidentified male suspect which escalated to gunfire. Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident. The investigation remains ongoing at this time.</p>\n<p><span data-olk-copy-source=\"MessageBody\">Please keep in mind that the information released is preliminary in nature and could change as the</span>&nbsp;investigation progresses or new information comes to light.</p>"},{"titles":"Person Shot: Peachtree Center Ave. NE & Ellis St. NW","bodies":"<div data-olk-copy-source=\"MessageBody\">Preliminary information: On October 28, 2025, at approximately 8:31 a.m., Atlanta Police Zone 5 officers responded to a report of a person shot at 33 Auditorium Pl. SE. Upon arriving on the scene, officers located a 36-year-old male victim who had sustained an apparent gunshot wound. The victim was alert, conscious, and breathing, and transported to the hospital by ambulance. Preliminary investigation indicates the male may have been shot near Peachtree Center Ave. NE &amp; Ellis St. NW. Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident. The investigation continues.</div>\n<div data-olk-copy-source=\"MessageBody\">&nbsp;</div>\n<div data-olk-copy-source=\"MessageBody\">Please keep in mind that the information released is preliminary in nature and could change as the&nbsp;investigation progresses or new information comes to light.</div>"},{"titles":"Officer Involved Shooting: 2045 Donald Lee Hollowell Parkway NW","bodies":"<div data-olk-copy-source=\"MessageBody\">Preliminary Statement: On October 27th, 2025, at approximately 6:13PM, officers responded to the Family Dollar located at 2045 Donald Lee Hollowell Parkway NW in reference to a criminal trespass. Upon arrival, the responding officer encountered an adult male. The responding officer attempted to question the male but the male fled from the location on foot and a foot chase ensued. The officer was able to locate the suspect at a nearby building at 2095 Donald Lee Hollowell Parkway NW. The preliminary investigation indicates that the male came toward the officer and the officer subsequently engaged the suspect in gunfire. The suspect was struck by the gunfire and fled on foot to 2080 Donald Lee Hollowell Parkway NW where he was given medical aid on scene by medical personnel and was later transported to a local hospital for treatment. The officer sustained minor injuries to her leg. Investigators with the Georgia Bureau of Investigation responded to the scene and will be leading the investigation. At this time, the investigation is ongoing.</div>\n<p data-olk-copy-source=\"MessageBody\">&nbsp;</p>\n<p data-olk-copy-source=\"MessageBody\">Press Conference:&nbsp;<a data-loopstyle=\"link\" data-unfurl-id=\"unfurl-id-28a06734-5db8-4e46-b78b-0c061674a62a\" tabindex=\"0\" id=\"x_ms-outlook-mobile-sharing-link-anchor-be3431c1-9555-4b4e-9879-89a4e410d7d8\" originalsrc=\"https://cityofatlanta-my.sharepoint.com/:v:/g/personal/afix_atlantaga_gov/Ec4PyD2xvW1OunS21abdrecBXMJaO7c7sryHdebs6bXc7g\" data-auth=\"NotApplicable\" rel=\"noreferrer noopener\" target=\"_blank\" href=\"https://cityofatlanta-my.sharepoint.com/:v:/g/personal/afix_atlantaga_gov/Ec4PyD2xvW1OunS21abdrecBXMJaO7c7sryHdebs6bXc7g?xsdata=MDV8MDJ8YWZpeEBBdGxhbnRhR2EuR292fDc4YjI0MTQxYjdkNTQ0NGIxNDgzMDhkZTE1ZTY5YWY1fDAzMWE1NTBhZjFmMzRiNjI5YzY0M2VmMDJjNzc5OGE1fDB8MHw2Mzg5NzIyNzczNzUyNDYxODN8VW5rbm93bnxUV0ZwYkdac2IzZDhleUpGYlhCMGVVMWhjR2tpT25SeWRXVXNJbFlpT2lJd0xqQXVNREF3TUNJc0lsQWlPaUpYYVc0ek1pSXNJa0ZPSWpvaVRXRnBiQ0lzSWxkVUlqb3lmUT09fDB8fHw%3d&amp;sdata=ZGJ0dzY0ck9jWldTc0VaN0p4b1AwUktkZlEzMDNQbGFWV1BuUmRBVDdkND0%3d\" data-linkindex=\"0\" title=\"Original URL: https://cityofatlanta-my.sharepoint.com/:v:/g/personal/afix_atlantaga_gov/Ec4PyD2xvW1OunS21abdrecBXMJaO7c7sryHdebs6bXc7g. Click or tap if you trust this link.\">IMG_0148.mov</a>&nbsp;</p>\n<p data-olk-copy-source=\"MessageBody\"><span data-olk-copy-source=\"MessageBody\">Please keep in mind that the information released is preliminary in nature and could change as the</span>&nbsp;investigation progresses or new information comes to light.</p>"},{"titles":"Officer Involved Shooting (OIS): 41 Irby Avenue NE","bodies":"<p><strong><b data-olk-copy-source=\"MessageBody\">Statement Update:</b>&nbsp;</strong>Please be advised that our preliminary statement has been updated to include a photograph of the involved officer, Officer Gerald Walker, in an effort to maintain accuracy and to prevent misinformation from circulating on social media regarding this incident.</p>\n<p><b data-olk-copy-source=\"MessageBody\">Previously Released:</b>&nbsp;On October 11, 2025, at approximately 11:35 p.m., an Atlanta Police officer working an extra job responded to a request for assistance from security at 5 Paces Inn, located at 41 Irby Avenue NE, regarding a disruptive patron. The officer encountered the individual attempting to reenter the establishment from the back parking lot (3198 Caines Hill Place). The preliminary investigation indicates that the suspect was in possession of a firearm. Investigators with the GBI were notified and will be leading the investigation. The responding officer was not injured.</p>\n<p><i>Please remember that the information released is limited and keep in mind, as the investigation progresses, the preliminary information could change, as is common with active investigations</i><i><img src=\"/home/showpublishedimage/4544/638971855728270000\" alt=\"GERALD WALKER\" style=\"margin:15px;\"></i></p>\n<p><i></i></p>"}]