[{"titles":"Juvenile Shot: 3390 Fairburn Rd SW","bodies":"On Friday, October 24, 2025, at approximately 2:20 a.m., Atlanta police responded to a report of a person shot at 3390 Fairburn Rd SW. Upon arrival, officers located a male juvenile who had sustained a gunshot wound to his foot. During the preliminary investigation, the juvenile admitted that he was shot after he had broken into a vehicle. He was transported to Arthur M. Blank Children’s Hospital, alert, conscious, and breathing, for medical treatment.\n \nFurther investigation revealed that the vehicle owner had confronted the juvenile during the break-in. At that time, the vehicle owner fired at the juvenile, striking him in the foot. The owner, identified as 51-year-old Yoshay Carter, was taken into custody and charged with Aggravated Assault. He was later transported to the Fulton County Jail without incident. The investigation remains ongoing at this time.\n \nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light.\n\n \nAll arrests and photos are public information.  An arrest does not mean that the individual has been or will be convicted of the crime. Individuals on this press release/post/video are presumed innocent until proven guilty by a court of law"},{"titles":"Person Shot: 925 Conley RD SE","bodies":"Preliminary information: On October 23rd, 2025, at approximately 3:37 P.M., officers responded to reports of a person shot near 935 Conley RD SE. Upon arrival, officers located a 23-year-old male suffering from an apparent gunshot wound. The victim was alert, conscious, breathing, and was transported to the hospital. Preliminary investigation indicates the suspect fled the scene in a vehicle with a child inside, who was inside the vehicle at the time of the incident. Officers later located the vehicle and safely recovered the child near 3187 Donnebroook LN SE. The child did not appear to be injured, and medical personnel were on scene to assist. Investigators with the Aggravated Assault unit responded to the scene to investigate the circumstances surrounding the incident. The investigation remains ongoing. \n \nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light"},{"titles":"Update: Officer Involved Auto Accident: 560 James P. Brawley Dr NW & North Avenue NW","bodies":"911 Audio - Officer Involved Auto Accident - 560 James P. Brawley Dr. NW - 252931858.wav\n Officer Safi Department Photo\nHire Date: 05/9/2024\nSwear-in Date: 12/2024\nCurrent Assignment: Zone 1 Field Operations Division\nOfficer Safi is currently in the hospital recovering from serious injuries sustained from his accident. We ask that the media respect the privacy of Officer Safi, his colleagues, and family during his time of recovery.\nPreviously Released...\nPreliminary Statement: On October 20th, 2025, at approximately 8:15PM, while en route to an officer requesting assistance call, an Atlanta Police Zone 1 Patrol Officer was involved in an auto accident. The preliminary investigation indicates that the patrol vehicle left the roadway and struck a home located at 560 James P. Brawley Drive NW. The officer was extricated from his vehicle by several witnesses and was subsequently transported to the hospital with serious injuries. The auto accident resulted in a fire which was quickly suppressed by firefighters with the Atlanta Fire Rescue Department. There was one person inside of the home at the time of the auto accident, however, they were uninjured during the incident. The Georgia State Patrol will be conducting an investigation into the incident.\nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Z1_3 Joseph E Lowery Blvd NW_Aggravated Assault_252951815_102225","bodies":"252951815 \nPreliminary Information: On October 22, 2025, at approximately 6:10 p.m., officers were conducting a proactive enforcement investigation involving suspicious persons at 3 Joseph E. Lowery Boulevard NW. During their investigation, a male suspect displayed a firearm, fired one round toward the officers, and then fled the location on foot, entering what appeared to be an unoccupied property near 71 Newcastle Street NW.\nNo officers nor citizens were struck by gunfire, nor did any officers discharge their service weapons. Officers engaged in a foot pursuit leading to the unoccupied home, where the suspect was still believed to be inside. A perimeter was established, and officers requested additional units for special assistance. The APD S.W.A.T. Unit, K-9 Unit, Homicide Unit, and Drone Unit responded to the scene. S.W.A.T. units made a successful entry into the home and around the immediate perimeter, and a 16-year-old juvenile male was located hiding in the Woodline near the unoccupied property. He was taken into custody without incident. Multiple charges are pending at this time as the investigation continues.\n \nPlease keep in mind the above information is preliminary in nature and can change as the investigation progresses and new information comes to light."},{"titles":"Person Shot: 440 Latta ST. NE","bodies":"Preliminary information: On October 22, 2025, at approximately 5:32 P.M., Atlanta Police Zone 6 officers responded to reports of a person shot near 440 Latta Street NE. Upon arrival, they located an 18-year-old male suffering from an apparent gunshot wound to the back. The victim was transported to the hospital by ambulance in critical condition. Officers later learned of a second victim, a 26-year-old male, who had sustained an apparent gunshot wound. He arrived at Emory Hospital by private vehicle and is alert, conscious, and breathing. Investigators responded to the scene to determine the circumstances surrounding the incident. The investigation remains ongoing.\n \nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Aggravated Assault: 635 Lindbergh Dr NE","bodies":"252932036\nPreliminary Information: On 10/20/25, around 11:15pm, officers responded to 635 Lindbergh Dr NE in reference to a person shot. Upon arrival, officers located a male victim with a gunshot wound to the leg. He was alert, conscious and breathing and transported to the hospital for treatment by EMS services. Preliminary investigation indicates the victim heard a dispute between a male and a female, possibly coming from a vehicle. The victim stated he then heard a gunshot then found himself struck in the leg. Investigators are working to determine the circumstances surrounding the incident. The investigation continues. \n \nPlease keep in mind the above information is preliminary in nature and can change as the investigation progresses and new information comes to light."},{"titles":"Update: Death Investigation: I-75 NB & Northside Dr. NW","bodies":"Investigation Update – October 20, 2025\n \nFurther investigation determined the 21-year-old male victim may have been shot during road rage incident and subsequently struck by two vehicles, including an Atlanta Police patrol vehicle, that was unaware of the original incident. \n \nThe Atlanta Police Department’s Homicide Unit is leading the investigation into the potential road rage shooting and Georgia State Patrol is leading the investigation into the pedestrian accidents.\n \nThe other involved party in the shooting remained on the scene and is cooperating with the investigation.\n \nThe investigation remains active and ongoing.\n \nPreliminary Statement - October 19, 2025\n \n On October 18, 2025, at approximately 10:20 p.m., Atlanta Police Zone 2 officers patrolling on I-75 NB near Northside Dr. NW discovered a 21-year-old male victim lying in the roadway. Responding medical personnel pronounced the victim deceased on the scene. Investigators with the Homicide Unit responded to the scene to determine the circumstances surrounding the incident. The official cause and manner of death will be determined by an autopsy by the Fulton County medical Examiner’s Office. The investigation continues.\n \nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Aggravated Assault: 390 Fairburn Rd SW","bodies":"252921820\nPreliminary Information: On 10/19/25, around 10:35pm, officers responded to persons shot at the location of 3390 Fairburn Rd SW. Upon arrival, officers located 2 males with gunshot wounds. Grady EMS responded to the scene and transported both victims to the hospital for treatment, one victim listed as critical, the other stable. Preliminary investigation indicates both victims sustained gunshot wounds during a dispute over a claiming ownership of a firearm that appears to be stolen. Investigators are working to determine the circumstances surrounding the incident. The investigation continues. \n \nPlease keep in mind the above information is preliminary in nature and can change as the investigation progresses and new information comes to light."},{"titles":"Homicide: 2070 Alison Ct. SW","bodies":"Preliminary information: On October 18, 2025, at approximately 10:02 p.m., Atlanta Police Zone 4 officers responded to a report of a person shot at 2070 Alison Ct. SW. Upon arriving on the scene, officers located a 33-year-old male victim who had sustained apparent gunshot wounds. The victim was pronounced deceased on the scene by responding medical personnel. Investigators with the Homicide Unit responded to the scene to determine the circumstances surrounding the incident. The investigation continues.\n \nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Person Shot: 340 McDaniel St. SW","bodies":"Preliminary information: On October 19, 2025, at approximately 4:01 a.m., Atlanta Police Zone 5 officers responded to a report of a person shot near 340 McDaniel St. SW. Upon arriving on the scene, officers located a 62-year-old male victim who had sustained multiple apparent gunshot wounds. The victim was alert, conscious, and breathing, and was transported to the hospital by ambulance. Preliminary investigation indicates the victim may have been asleep outside when he heard gunfire and subsequently sustained his injuries. Investigators responded to the scene to determine the circumstances surrounding the incident. The investigation continues.\n \nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Person Shot: 182 Courtland St. NE","bodies":"Preliminary information: On October 19, 2025, at approximately 3:28 a.m., Atlanta Police Zone 5 officers responded to a report of a person shot near 182 Courtland St. NE. Upon arriving on the scene, officers located a 20-year-old female victim who had sustained an apparent gunshot wound. The victim was alert, conscious, and breathing, and transported to the hospital by ambulance. Preliminary investigation indicates the victim may have been standing near Courtland St. NE & Andrew Young International Blvd. NE when she heard gunfire and subsequently sustained her injury. Investigators responded to the scene to determine the circumstances surrounding the incident. The investigation continues.\n \nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Person Shot: 369 McDaniel St. SW","bodies":"Preliminary information: On October 18, 2025, at approximately 9:11 p.m., Atlanta Police Zone 1 officers responded to a report of a person shot near 995 Mayson Turner Rd. NW. Upon arriving on the scene, officers located a 33-year-old male victim who had sustained an apparent gunshot wound. The victim was alert, conscious, and breathing, and was transported to the hospital by ambulance. Preliminary investigation indicates the victim may have been shot during a narcotics transaction near 369 McDaniel St. SW, before self-transporting to 995 Mayson Turner Rd. NW. Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident. The investigation continues.\n \nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Crime Stoppers BOLO: APD Seeks Assistance Identifying Robbery Suspect","bodies":"Investigators with the Atlanta Police Department’s Robbery Unit are seeking the public’s assistance in identifying a male suspect involved in a robbery seen in the video and photos in the link below.\nLink to video/photos : Crime Stoppers Bolo-Robbery-409 University AVE SW-252290100\nPreliminary information: On August 16, 2025, at approximately 12:52 A.M., Officers responded to reports of a pedestrian robbery at 409 University AVE. SW. Preliminary findings indicate the suspect, who goes by the name of \"JJ,\" asked the victim for a cigarette, and the victim declined. The suspect then produced a firearm and forced the victim to give him his personal belongings. Investigators are asking for anyone with information on the suspect to submit a tip to Crime Stoppers.\n \nPersons do not have to give their name or any identifying information to be eligible for the reward of up to $5,000 for the arrest and indictment of the suspect.\n Tips can be submitted anonymously in the following ways:\n\n    Call the CSGA tip line at 404-577-8477\n    Visit www.stopcrimeatl.org\n    Use the P3 app\n    \n    Text CSGA to 738477\n    \n\n\nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Person Shot: 507 Joseph E Lowery BLVD SW","bodies":"Preliminary Statement: On October 18th, 2025, at approximately 8:12 A.M., officers responded to reports of a person shot at 507 Joseph E Lowery BLVD SW. Upon arrival, officers located a 26-year-old male who sustained an apparent gunshot wound. The male was alert, conscious, and breathing and was transported to the hospital via ambulance. The victim would not provide information as to where the incident took place. Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident. The investigation remains ongoing at this time.\nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Person Stabbed: 1991 Delowe Drive SW","bodies":"Preliminary Statement: On October 17th, 2025, at approximately 10:00PM, officers responded to 1991 Delowe Drive SW in reference to a person stabbed. Upon arrival, officers located a 59-year-old male who sustained an apparent stab wound to his head. The male was alert, conscious, breathing, and was treated on scene by medical personnel. The preliminary investigation indicates that the male was involved in a verbal altercation with a known female suspect that escalated to a physical dispute. Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident. The investigation remains ongoing at this time.\nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Person Shot: 1295 Donnelly AVE SW","bodies":"Preliminary Statement: On October 17th, 2025, at approximately 5:35 P.M., officers responded to reports of a person shot at 1295 Donnelly AVE SW. Upon arrival, officers located a 20-year-old male who sustained apparent gunshot wounds. The male was alert, conscious, and breathing. The male was transported to the hospital via ambulance. Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident. The investigation remains ongoing at this time.\nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Person Shot: 2135 Piedmont RD NE","bodies":"Preliminary Statement: On October 17th, 2025, at approximately 4:44 P.M., officers responded to reports of a person shot at 2135 Piedmont RD NE. Upon arrival, officers located a 39-year-old male who sustained an apparent gunshot wound. The male was alert, conscious, and breathing. Preliminary findings indicate the shooting occurred sometime around 8:00 P.M., on October 16th, 2025. Investigators with the Aggravated Assault Unit responded to the scene to determine the circumstances surrounding the incident. The investigation remains ongoing at this time.\nPlease keep in mind that the information released is preliminary in nature and could change as the investigation progresses or new information comes to light."},{"titles":"Business Burglary: 2986 Campbellton Rd SW","bodies":"252900432\nPreliminary Information: On 10/17/25, around 5:45am, officers responded to a burglary at the location of 2986 Campbellton Rd SW. Upon arrival, officers observed a large, damaged hole in the rear wall of the building. Officers made entry and cleared the business. There were no suspects or victims located. Inside the location, officers observed a safe that sustained visible damage as well as U.S. currency scattered throughout the floor. The business’s owner arrived on scene and stated the safe was cut open with approximately $28,803.00 missing in cash. Preliminary investigation indicates a silver Toyota Camry with the license plate CZB9958 arrived at the location around 5:20am. Two male suspects exited the vehicle and went behind the business. One of the male suspects appeared to be striking and cutting into the wall with a device as the other acted as a lookout. The suspects made entry, stole sums of currency then fled the scene in the Toyota Camry. Investigators are working to determine the circumstances surrounding the incident. The investigation continues. \n\n\n\nPlease keep in mind the above information is preliminary in nature and can change as the investigation progresses and new information comes to light.\n\n \n\n\nAnyone with information on this case can submit a tip anonymously to the Crime Stoppers Atlanta tip line at 404-577-TIPS (8477), online at www.StopCrimeAtl.org, or by texting CSGA. Persons do not have to give their name or any identifying information to be eligible for a reward of up to $5,000."}]